[
  {
    "uid": "89303736-3440-4f32-8793-4e77c0e85361",
    "firstName": "Karen",
    "lastName": "Taylor",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=KarenTaylor",
    "projectType": "interior",
    "property": "home",
    "review": "Roll On Painting transformed our living room and bedrooms. The colors look fantastic, and the finish is flawless. They worked efficiently, cleaned up daily, and were very respectful of our home. I highly recommend them for anyone looking for professional interior painting done right.",
    "rating": 3.5
  },
  {
    "uid": "293058ba-1a1c-48d4-9ec0-c09d20850080",
    "firstName": "Daniel",
    "lastName": "Taylor",
    "gender": "male",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=DanielTaylor",
    "projectType": "interior",
    "property": "home",
    "review": "We hired Roll On Painting to refresh our basement and kitchen walls. The team was prompt, friendly, and paid attention to every detail. They even helped us choose colors that brightened the space beautifully. Excellent craftsmanship and customer service—our home feels brand new again!",
    "rating": 3
  },
  {
    "uid": "13016c85-9a60-455c-a2d5-b151e49d5345",
    "firstName": "Michael",
    "lastName": "Martin",
    "gender": "male",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=MichaelMartin",
    "projectType": "interior",
    "property": "home",
    "review": "Roll On Painting did an amazing job repainting our main floor. The walls are smooth, and the trim looks sharp and clean. They were very tidy and kept everything organized throughout the project. We’re thrilled with the results and will call them again for future work.",
    "rating": 4
  },
  {
    "uid": "fa7dde09-521f-48ac-95da-dc921f241032",
    "firstName": "Karen",
    "lastName": "Anderson",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=KarenAnderson",
    "projectType": "interior",
    "property": "home",
    "review": "I had Roll On Painting redo our bedrooms and hallways. The painters were skilled, courteous, and efficient. They worked around our schedule and left everything spotless. The quality of the finish is outstanding—no streaks or missed spots. We couldn’t be happier with their work.",
    "rating": 3
  },
  {
    "uid": "9e671b1d-e9ae-4111-9d7d-0b54ca1eb0f6",
    "firstName": "David",
    "lastName": "Thomas",
    "gender": "male",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=DavidThomas",
    "projectType": "interior",
    "property": "home",
    "review": "Roll On Painting just finished painting our dining room, kitchen, and stairwell. They delivered exactly what they promised and more. The attention to detail on the trim and ceiling edges was impressive. Great communication, reasonable pricing, and professional service all the way through.",
    "rating": 4
  },
  {
    "uid": "a4d3fb7e-29b5-4b3e-905f-ee45d063e9b7",
    "firstName": "Michael",
    "lastName": "Jackson",
    "gender": "male",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=MichaelJackson",
    "projectType": "interior",
    "property": "condo",
    "review": "Our condo interior was painted by Roll On Painting, and the results exceeded expectations. The painters were punctual, respectful, and very neat. They took care with every corner and detail, leaving us with a fresh, bright space. I highly recommend them for quality interior painting.",
    "rating": 3
  },
  {
    "uid": "7d224d7e-5da0-4949-944c-9b782c5edab6",
    "firstName": "Barbara",
    "lastName": "Johnson",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=BarbaraJohnson",
    "projectType": "interior",
    "property": "home",
    "review": "Roll On Painting painted our family room and two bedrooms, and the outcome was beautiful. They offered advice on colors and finishes, which helped us make the right choices. Their team worked quickly without sacrificing quality. The whole experience was stress-free and professional.",
    "rating": 3.5
  },
  {
    "uid": "ef4ba99c-ff1d-4a4f-849b-d0624916d3b7",
    "firstName": "Elizabeth",
    "lastName": "Harris",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=ElizabethHarris",
    "projectType": "interior",
    "property": "home",
    "review": "We had Roll On Painting do our living room and office. The results are smooth, even coats with crisp edges—exactly what we wanted. They were very polite, cleaned up every day, and made sure everything looked perfect before finishing. We’ll definitely be calling them again.",
    "rating": 3
  },
  {
    "uid": "e36bfaeb-d98d-4366-b3ee-9e67770f1dc9",
    "firstName": "David",
    "lastName": "Harris",
    "gender": "male",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=DavidHarris",
    "projectType": "interior",
    "property": "home",
    "review": "Roll On Painting painted our stairwell and upper hallway. It was tricky, but they handled it perfectly with no mess. The lines are sharp, and the color is even throughout. Their crew was courteous and professional. They turned a difficult job into a flawless finish.",
    "rating": 3.5
  },
  {
    "uid": "9ea09062-a792-4e9e-b393-93bbe1fc2af0",
    "firstName": "Robert",
    "lastName": "Martin",
    "gender": "male",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=RobertMartin",
    "projectType": "interior",
    "property": "home",
    "review": "Our bedroom and ensuite bathroom look amazing thanks to Roll On Painting. They were detail-oriented, neat, and professional from start to finish. The painters took extra care with our furniture and flooring, leaving no mess behind. We’re extremely satisfied with the quality of their work.",
    "rating": 5
  },
  {
    "uid": "0e05fdd9-7416-4a4e-a9b1-3eb2e83edfc9",
    "firstName": "Elizabeth",
    "lastName": "Martin",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=ElizabethMartin",
    "projectType": "exterior",
    "property": "home",
    "review": "Roll On Painting repainted the exterior of our house, and it looks fantastic. The curb appeal has improved dramatically. They worked quickly, communicated well, and delivered a perfect finish. Everything was done professionally from prep to cleanup. Our home looks refreshed and well cared for.",
    "rating": 3
  },
  {
    "uid": "19af4240-5662-4e29-b0eb-3d572b7a6569",
    "firstName": "Barbara",
    "lastName": "Smith",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=BarbaraSmith",
    "projectType": "exterior",
    "property": "home",
    "review": "We hired Roll On Painting for exterior siding and trim, and they exceeded expectations. The paint job is flawless, with sharp lines and beautiful coverage. They also took care of minor repairs before painting. Their crew was punctual, hardworking, and very respectful of our property.",
    "rating": 3
  },
  {
    "uid": "65a090c5-2669-4fd7-8720-c1f089d8216a",
    "firstName": "Jessica",
    "lastName": "Smith",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=JessicaSmith",
    "projectType": "exterior",
    "property": "home",
    "review": "Roll On Painting gave our home’s exterior a new life. The paint is even, the lines are clean, and the finish is beautiful. They handled everything from power washing to final touch-ups with great care. Professional, reliable, and detail-focused service. We couldn’t be happier.",
    "rating": 3.5
  },
  {
    "uid": "873ef00c-96aa-4738-a4a4-fba289ebc39b",
    "firstName": "Thomas",
    "lastName": "Martin",
    "gender": "male",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=ThomasMartin",
    "projectType": "exterior",
    "property": "home",
    "review": "Our old siding and trim were badly faded, but Roll On Painting brought them back to life. The house looks brighter and more modern now. They kept us updated throughout the project and finished ahead of schedule. Truly professional painters who know how to deliver quality.",
    "rating": 3.5
  },
  {
    "uid": "fe0f8d53-bd2a-4f72-9d9d-6f0feb9963fa",
    "firstName": "Elizabeth",
    "lastName": "White",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=ElizabethWhite",
    "projectType": "exterior",
    "property": "garage",
    "review": "Roll On Painting did an incredible job repainting our garage and exterior trim. The fresh coat completely transformed the look of our home. They worked efficiently, kept the site clean, and were very easy to communicate with. We’re thrilled with the result and highly recommend them.",
    "rating": 4.5
  },
  {
    "uid": "9ce0cb90-755b-43b3-8046-89e988509cf1",
    "firstName": "Jessica",
    "lastName": "Anderson",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=JessicaAnderson",
    "projectType": "exterior",
    "property": "home",
    "review": "We had Roll On Painting repaint our entire exterior, and the difference is unbelievable. The colors are rich, the finish is smooth, and everything looks brand new. Their attention to prep work made the outcome flawless. They were friendly, reliable, and very professional throughout.",
    "rating": 4.5
  },
  {
    "uid": "947a8f16-8b1b-4a9a-97d1-3cbc799834b0",
    "firstName": "James",
    "lastName": "Anderson",
    "gender": "male",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=JamesAnderson",
    "projectType": "exterior",
    "property": "home",
    "review": "Roll On Painting did our exterior siding and doors, and we are impressed. The team arrived on time, explained the process, and kept everything neat and organized. The house now has fantastic curb appeal, and the finish looks like it will last for years.",
    "rating": 3.5
  },
  {
    "uid": "142affc0-725f-45f8-b096-8f9877ef4940",
    "firstName": "John",
    "lastName": "Taylor",
    "gender": "male",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=JohnTaylor",
    "projectType": "exterior",
    "property": "home",
    "review": "Our home’s exterior was painted by Roll On Painting, and the results are outstanding. The painters were thorough, professional, and respectful of our landscaping. The house looks refreshed and vibrant now. From start to finish, they exceeded our expectations. I would definitely hire them again.",
    "rating": 3.5
  },
  {
    "uid": "33f1315c-3a9a-438c-8ce1-a02691809617",
    "firstName": "Mary",
    "lastName": "Smith",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=MarySmith",
    "projectType": "exterior",
    "property": "deck",
    "review": "Roll On Painting painted our deck and exterior trim. The finish is smooth, durable, and beautifully done. The crew was efficient and detail-oriented, and they took the time to ensure everything looked perfect. We are very satisfied with the work and highly recommend them.",
    "rating": 4
  },
  {
    "uid": "0eef8bdc-a967-44c8-a339-16f3908f006c",
    "firstName": "Patricia",
    "lastName": "Anderson",
    "gender": "female",
    "avatar": "https://api.dicebear.com/7.x/avataaars/svg?seed=PatriciaAnderson",
    "projectType": "exterior",
    "property": "home",
    "review": "We hired Roll On Painting for our exterior repaint, and they did an amazing job. The house looks completely renewed, with crisp lines and even coverage. They worked efficiently, cleaned up daily, and communicated clearly. A fantastic team delivering top-quality work.",
    "rating": 4
  }
]